

# !!!!!!  ДЛЯ ЗАПУСКА ОТДЕЛЬНЫХ ЗАДАНИЙ РАСКОММЕНТИРУЙТЕ ИХ РЕШЕНИЕ  !!!!!!


# Домашняя работа на 16.04.2023.


# Модуль 10. Объектно-ориентированное
# программирование
#
# Тема: Статические методы

# Задание 1
# Доделать задание 4 от урока за 08.04.2023, которое звучит так:
# Создайте класс "Дробь". Необходимо хранить в полях класса: числитель
# и знаменатель. Можно не делать реализацию методов класса для ввода данных,
# вывода данны и реализацию доступа к отдельным полям через методы класса.
# Также создайте методы класса для выполнения арифметических операций (сложение,
# вычитание, умножение, деление и т.д.)


# К уже реализованному классу «Дробь» добавьте статический метод,
# который при вызове возвращает количество созданных объектов класса «Дробь».
#
#
#
#
#
#
# Задание 2
# Создайте класс для конвертирования температуры из
# Цельсия в Фаренгейт и наоборот. У класса должно быть
# два статических метода: для перевода из Цельсия в Фаренгейт и для перевода из Фаренгейта в Цельсий. Также
# класс должен считать количество подсчетов температуры и
# возвращать это значение с помощью статического метода.
#
#
#
# Задание 3
# Создайте класс для перевода из метрической системы
# в английскую и наоборот. Функциональность необходимо
# реализовать в виде статических методов. Обязательно
# реализуйте перевод мер длины.